src/DataProcessors/ИС_Сбер_ВыгрузкаКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_Сбер_ВыгрузкаКарточек</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_Сбер_Фид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Сбер_Фид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>offer_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>available</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>category</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vendor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vendor_code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>model</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>old_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>picture</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>url</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_before</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>days</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_Сбер_НастройкиВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Сбер_НастройкиВыгрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_Сбер_ВыгрузкаКарточек/Forms/Форма/Ext/Form/Module.bsl
#Область ЗагрузкаИзEXCEL

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ЗаполнитьИзExcel();
КонецПроцедуры

&НаСервере 
Функция ОбработкаПереданногоФайлаНаСервере(Знач АдресХранилища, Знач Ссылка)
	
	ВременныйТД = Новый ТабличныйДокумент;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);	
	ВременныйФайлТаблицы = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ВременныйФайлТаблицы);
	
	ВременныйТД = Новый ТабличныйДокумент;
	ВременныйТД.Прочитать(ВременныйФайлТаблицы,СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	Для Каждого ОбластьТД ИЗ ВременныйТД.Области Цикл
		ИмяОбласти = ОбластьТД.Имя;
		Если ИмяОбласти = "Инструкция" Тогда
			Инструкция.Вывести(ВременныйТД.ПолучитьОбласть(ОбластьТД.Имя));
		ИначеЕсли ИмяОбласти = "Список_товаров" Тогда
			СписокТоваров.Вывести(ВременныйТД.ПолучитьОбласть(ОбластьТД.Имя));
		КонецЕсли;
	КонецЦикла;
	
	УдалитьИзВременногоХранилища(АдресХранилища);
	УдалитьФайлы(ВременныйФайлТаблицы);
	
	Элементы.ГруппаСтраницыExcel.ТекущаяСтраница = Элементы.СтраницаСписокТоваров;
КонецФункции

&НаКлиенте
Процедура ОповещениеПомещениеФайла(ПомещенныеФайлы, ДополнительныеПараметры)Экспорт
	Если ТипЗнч(ПомещенныеФайлы) = Тип("Массив") Тогда
		ОбработкаПереданногоФайлаНаСервере(ПомещенныеФайлы[0].Хранение, ДополнительныеПараметры);
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы.Количество() > 0 Тогда
		ИмяФайла = ВыбранныеФайлы[0];
		
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла();
		ОписаниеФайла.Имя = ИмяФайла;
		
		ПомещаемыеФайлы = Новый Массив;
		ПомещаемыеФайлы.Добавить(ОписаниеФайла);
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеПомещениеФайла", ЭтаФорма, ДополнительныеПараметры);
		НачатьПомещениеФайлов(Оповещение, ПомещаемыеФайлы,, Ложь, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзExcel()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр =  "Excel (*.xlsx)|*.xlsx|Excel 97-2010 (*.xls)|*.xls";
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ОписаниеОповещенияВыбораФайла", ЭтаФорма, Новый Структура("Расширение", ДиалогВыбораФайла.Расширение)));
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеВEXCEL

&НаСервере
Процедура СформироватьEXCELПоДаннымСпискаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СформироватьEXCELПоДаннымСписка(Команда)
	СформироватьEXCELПоДаннымСпискаНаСервере();
КонецПроцедуры


&НаСервере
Процедура СохранитьВФайлНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СохранитьВФайл(Команда)
	СохранитьВФайлНаСервере();
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ПереопределитьЗапросСпискаТоваровФида() 
	
	СписокТоваровФида.ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ИС_Сбер_Фид.Профиль КАК Профиль,
		|	ИС_Сбер_Фид.Номенклатура КАК Номенклатура,
		|	ИС_Сбер_Фид.offer_id КАК offer_id,
		|	ИС_Сбер_Фид.available КАК available,
		|	ИС_Сбер_Фид.category КАК category,
		|	ИС_Сбер_Фид.vendor КАК vendor,
		|	ИС_Сбер_Фид.vendor_code КАК vendor_code,
		|	ИС_Сбер_Фид.model КАК model,
		|	ИС_Сбер_Фид.name КАК name,
		|	ИС_Сбер_Фид.vat КАК vat,
		|	ИС_Сбер_Фид.old_price КАК old_price,
		|	ИС_Сбер_Фид.price КАК price,
		|	ИС_Сбер_Фид.barcode КАК barcode,
		|	ИС_Сбер_Фид.picture КАК picture,
		|	ИС_Сбер_Фид.description КАК description,
		|	ИС_Сбер_Фид.url КАК url,
		|	ИС_Сбер_Фид.order_before КАК order_before,
		|	ИС_Сбер_Фид.days КАК days,
		|	0 КАК instock,
		|	ВЫБОР
		|		КОГДА ИС_Сбер_Фид.offer_id = """"
		|			ТОГДА ИСТИНА
		|		КОГДА ИС_Сбер_Фид.category = """"
		|			ТОГДА ИСТИНА
		|		КОГДА ИС_Сбер_Фид.vendor = """"
		|			ТОГДА ИСТИНА
		|		КОГДА ИС_Сбер_Фид.vendor_code = """"
		|			ТОГДА ИСТИНА
		|		КОГДА ИС_Сбер_Фид.name = """"
		|			ТОГДА ИСТИНА
		|		КОГДА ИС_Сбер_Фид.model = """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Проблема
		|ИЗ
		|	РегистрСведений.ИС_Сбер_Фид КАК ИС_Сбер_Фид
		|ГДЕ
		|	ИС_Сбер_Фид.Профиль = &ЛичныйКабинет";
	
		Изучение = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокТоваровФидаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)  
	
	//ПараметрЛичногоКабинета = Настройки.ПараметрыДанных.Элементы.Найти("ЛичныйКабинет"); 
	//
	//Если ПараметрЛичногоКабинета <> Неопределено Тогда 
		
		//ЛичныйКабинетСписка = ПараметрЛичногоКабинета.Значение;
		//
		//ТаблицаСоответствия = Новый ТаблицаЗначений;
		//ТаблицаСоответствия.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		//ТаблицаСоответствия.Колонки.Добавить("ВидЦены",		Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
		//
		////Указание вида цен в поле old_price
		//Настройка_old_price = ЛичныйКабинетСписка.НастройкаФидов.НастройкиПолей.Найти("old_price","Поле");
		//СписокВозможныхЦен = sberВспомогательныеМетоды.СформироватьСписокТекстовогоПредставленияВидовЦен();
		//ВероятныйЭлемент = СписокВозможныхЦен.НайтиПоЗначению(Настройка_old_price.Настройка);
		//Если ВероятныйЭлемент = Неопределено Тогда
		//	ЗначениеСтаройЦены = Неопределено;
		//Иначе
		//	ЗначениеСтаройЦены = ЗначениеИзСтрокиВнутр(ВероятныйЭлемент.Значение);
		//КонецЕсли;
		//
		//МассивТоваров = Новый Массив;
		//Для Каждого Строка Из Строки Цикл
		//	ДанныеСтроки = Строка.Значение.Данные;
		//	МассивТоваров.Добавить(ДанныеСтроки.Номенклатура);
		//КонецЦикла;
		//
		//ТаблицаЦен = Справочники.sberЛичныеКабинеты.СформироватьТаблицуСоответствияВидовЦенТовара(ЛичныйКабинетСписка,МассивТоваров,ЗначениеСтаройЦены);
		//УказаниеСтаройЦены = ТаблицаЦен.Колонки.Найти("ДополнительнаяЦена") <> Неопределено;
		//Для Каждого Строка Из Строки Цикл
		//	ДанныеСтроки = Строка.Значение.Данные;
		//	СтрокаСЦеной = ТаблицаЦен.Найти(ДанныеСтроки.Номенклатура,"Номенклатура");
		//	Если СтрокаСЦеной = Неопределено Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	ДанныеСтроки.price = СтрокаСЦеной.Цена;
		//	Если УказаниеСтаройЦены Тогда
		//		ДанныеСтроки.old_price = СтрокаСЦеной.ДополнительнаяЦена;
		//	КонецЕсли;
		//КонецЦикла;
	//КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЛичногоКабинета() 
	
	//+ ИнфоСофт Ивонин К.А. 05.03.25 УА #92887
	//МассивПараметров = Новый Массив;
	//МассивПараметров.Добавить("СберСклад");
	//
	//Настройки = ИС_MP_Сервер.ПолучитьНастройки(ЛичныйКабинет, МассивПараметров);
	//
	//Если Настройки <> Неопределено Тогда
	//	Склад = Настройки["СберСклад"];
	//Иначе
	//	Возврат;
	//КонецЕсли;
	
	Склад = ИС_Сбер_Сервер.ПолучитьСкладПоУмолчанию(ЛичныйКабинет);
	//- ИнфоСофт Ивонин К.А. 05.03.25 УА #92887  
		
	Если ЛичныйКабинет.Пустая() Тогда
		СписокТоваровФида.Параметры.УстановитьЗначениеПараметра("ЛичныйКабинет",	Неопределено);
		//СписокТоваровФида.Параметры.УстановитьЗначениеПараметра("Склады",			Новый Массив);
	Иначе
		СписокТоваровФида.Параметры.УстановитьЗначениеПараметра("ЛичныйКабинет",	ЛичныйКабинет);
		//СписокТоваровФида.Параметры.УстановитьЗначениеПараметра("Склады",			Склад);
		//Если ЛичныйКабинет.ИсточникПолученияОстатков = Перечисления.sberИсточникиОстатков.ТоварыОрганизации Тогда
		//	СписокТоваровФида.Параметры.УстановитьЗначениеПараметра("Организация",	ЛичныйКабинет.Организация);
		//ИначеЕсли ЛичныйКабинет.ИсточникПолученияОстатков = Перечисления.sberИсточникиОстатков.ОстаткиИДоступность Тогда
		//	СписокТоваровФида.Параметры.УстановитьЗначениеПараметра("ТекДата",	ТекущаяДата());
		//КонецЕсли;
	КонецЕсли;
	
	Если СписокТоваровФида.Параметры.Элементы.Найти("Организация") <> Неопределено Тогда
		СписокТоваровФида.Параметры.УстановитьЗначениеПараметра("Организация",	ЛичныйКабинет.Организация);
	КонецЕсли;
	Если СписокТоваровФида.Параметры.Элементы.Найти("ТекДата") <> Неопределено Тогда
		СписокТоваровФида.Параметры.УстановитьЗначениеПараметра("ТекДата",	ТекущаяДатаСеанса());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНастроек(парПредставление,парПоле,парФиксация,парОбязательное,парСодержитЗначениеПоУмолчанию = Ложь)
	добСтрока = ТаблицаНастроекПолей.Добавить();
	добСтрока.ПолеНастройки	= парПоле;
	добСтрока.Представление	= парПредставление;
	добСтрока.Фиксация		= парФиксация;
	добСтрока.Обязательное	= парОбязательное;
	добСтрока.СодержитЗначениеПоУмолчанию = парСодержитЗначениеПоУмолчанию;
КонецПроцедуры

&НаСервере
Процедура ИнициализацияТаблицыНастроек()
	ДобавитьСтрокуНастроек("id",					"offer_id",		Ложь,	Истина);
	ДобавитьСтрокуНастроек("Доступность товара",	"available",	Ложь,	Истина,	Истина);
	ДобавитьСтрокуНастроек("Категория",				"category",		Ложь,	Истина);
	ДобавитьСтрокуНастроек("Производитель (Бренд)",	"vendor",		Ложь,	Истина);
	//+ ИнфоСофт Заварин К.В. 16.09.24 УА #68384
	//ДобавитьСтрокуНастроек("Артикул",				"vendor_code",	Истина,	Истина);    
	ДобавитьСтрокуНастроек("Артикул",				"vendor_code",	Ложь,	Истина);
	//- ИнфоСофт Заварин К.В. 16.09.24 УА #68384
	ДобавитьСтрокуНастроек("Модель",				"model",		Ложь,	Истина);
	ДобавитьСтрокуНастроек("Название",				"name",			Ложь,	Истина);
	ДобавитьСтрокуНастроек("Цена (руб)",			"price",		Ложь,	Ложь);
	ДобавитьСтрокуНастроек("Старая цена (руб)",		"old_price",	Ложь,	Ложь);
	ДобавитьСтрокуНастроек("Остаток",				"instock",		Истина,	Истина);
	ДобавитьСтрокуНастроек("НДС",					"vat",			Ложь,	Истина);
	ДобавитьСтрокуНастроек("Штрихкод",				"barcode",		Истина,	Ложь);
	ДобавитьСтрокуНастроек("Ссылка на картинку",	"picture",		Ложь,	Ложь);
	ДобавитьСтрокуНастроек("Описание",				"description",	Истина,	Ложь);
	ДобавитьСтрокуНастроек("Ссылка на товар на сайте магазина","url",Ложь,	Ложь);
	ДобавитьСтрокуНастроек("Время заказа До",		"order-before",	Ложь,	Ложь,	Истина);
	ДобавитьСтрокуНастроек("Дней на отгрузку",		"days",			Ложь,	Ложь,	Истина);
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуСоответствияНастроек(парПоле, 
											парВариант, 
											парНастройка = Неопределено, 
											парПустоеПоле = Ложь, 
											парСодержитЗначениеПоУмолчанию = Ложь)
											
	добСтрока = ТаблицаСоответствияНастроек.Добавить();
	добСтрока.ПолеНастройки	= парПоле;
	добСтрока.Вариант		= парВариант;
	добСтрока.Настройка		= парНастройка;
	добСтрока.ПустоеПоле	= парПустоеПоле;
	добСтрока.СодержитЗначениеПоУмолчанию = парСодержитЗначениеПоУмолчанию;
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуСоответствияНастроек()
	//ДобавитьСтрокуСоответствияНастроек("offer_id",	"Значение из настроек магазина", ЛичныйКабинет.ПолеOfferID);
	ДобавитьСтрокуСоответствияНастроек("offer_id",	"Артикул", "Артикул"); 
	ДобавитьСтрокуСоответствияНастроек("offer_id",	"Код", "Код"); 
	ДобавитьСтрокуСоответствияНастроек("offer_id",	"Другое >>"); 
	ДобавитьСтрокуСоответствияНастроек("offer_id",	"Ручной ввод");
	
	ДобавитьСтрокуСоответствияНастроек("available",	"Доступен",		Истина,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("available",	"Не доступен",	Ложь,	,Истина);
	
	ДобавитьСтрокуСоответствияНастроек("category",	"Родительская группа",	"Родитель.Наименование");
	ДобавитьСтрокуСоответствияНастроек("category",	"Вид номенклатуры",		"ВидНоменклатуры.Наименование");
	
	ДобавитьСтрокуСоответствияНастроек("vendor",	"Производитель (бренд)","Производитель");
	ДобавитьСтрокуСоответствияНастроек("vendor",	"Марка (бренд)",		"Марка");
	
	ДобавитьСтрокуСоответствияНастроек("vendor_code","Артикул","Артикул"); 
	//+ ИнфоСофт Заварин К.В. 16.09.24 УА #68384
	ДобавитьСтрокуСоответствияНастроек("vendor_code","Артикул + Характеристика", "Артикул");
	//- ИнфоСофт Заварин К.В. 16.09.24 УА #68384
	
	ДобавитьСтрокуСоответствияНастроек("model",		"Артикул","Артикул");
	ДобавитьСтрокуСоответствияНастроек("model",		"Другое >>");
	
	ДобавитьСтрокуСоответствияНастроек("name",		"Наименование",				"Наименование");
	ДобавитьСтрокуСоответствияНастроек("name",		"Наименование для печати",	"НаименованиеПолное");
	//+ ИнфоСофт Заварин К.В. 16.09.24 УА #68384
	ДобавитьСтрокуСоответствияНастроек("name",		"Наименование + Характеристика", "Наименование");
	//- ИнфоСофт Заварин К.В. 16.09.24 УА #68384

	
	ДобавитьСтрокуСоответствияНастроек("price",	"Цена по настройкам профиля");
	ДобавитьСтрокуСоответствияНастроек("price",	"Ручной ввод");

	
	ДобавитьСтрокуСоответствияНастроек("old_price",	"Ручной ввод");
	ДобавитьСтрокуСоответствияНастроек("old_price",	"Вид цен >>");
	//ДобавитьСтрокуСоответствияНастроек("old_price",	"Другое >>");
	
	ДобавитьСтрокуСоответствияНастроек("instock",	"Остатки по настройкам магазина");
	
	ДобавитьСтрокуСоответствияНастроек("vat",		"Ставка НДС (Номенклатура)",	"СтавкаНДС");
	ДобавитьСтрокуСоответствияНастроек("vat",		"Ставка НДС (Вид номенклатуры)","ВидНоменклатуры.СтавкаНДС");
	
	ДобавитьСтрокуСоответствияНастроек("barcode",	"Штрихкод номенклатуры");
	
	ДобавитьСтрокуСоответствияНастроек("picture",	"Ручной ввод");
	ДобавитьСтрокуСоответствияНастроек("picture",	"Другое >>");
	
	ДобавитьСтрокуСоответствияНастроек("description", "Текстовое описание","Описание");
	
	ДобавитьСтрокуСоответствияНастроек("url",		"Ручной ввод");
	ДобавитьСтрокуСоответствияНастроек("url",		"Другое >>");
	
	ДобавитьСтрокуСоответствияНастроек("order-before",	9, 9,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	10, 10,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	11, 11,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	12, 12,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	13, 13,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	14, 14,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	15, 15,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	16, 16,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	17, 17,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	18, 18,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	19, 19,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	20, 20,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	21, 21,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	22, 22,	,Истина);
	ДобавитьСтрокуСоответствияНастроек("order-before",	23, 23,	,Истина);
	
	ДобавитьСтрокуСоответствияНастроек("days",	"1 день",	"1 день",	,Истина);
	ДобавитьСтрокуСоответствияНастроек("days",	"2 дня",	"2 дня",	,Истина);
	ДобавитьСтрокуСоответствияНастроек("days",	"3 дня",	"3 дня",	,Истина);
	ДобавитьСтрокуСоответствияНастроек("days",	"4 дня",	"4 дня",	,Истина);
	ДобавитьСтрокуСоответствияНастроек("days",	"5 дней",	"5 дней",	,Истина);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПереопределитьЗапросСпискаТоваровФида();
	ИнициализацияТаблицыНастроек();
	СформироватьТаблицуСоответствияНастроек();
	
	СписокДополнительныхРеквизитов = СформироватьСписокДополнительныхСвойствИАтрибутовНоменклатуры();
	СписокТекстовогоПредставленияВидовЦен = СформироватьСписокТекстовогоПредставленияВидовЦен();
	
	//Проверка = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления;
	//Для Каждого ЗП Из Проверка Цикл
	//	Если ЗП.Имя = "НДС18" Тогда
	//		ЗначениеНДС18 = Перечисления.СтавкиНДС[ЗП.Имя];
	//	ИначеЕсли ЗП.Имя = "НДС18_118" Тогда
	//		ЗначениеНДС18118 = Перечисления.СтавкиНДС[ЗП.Имя];
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНастройкиФидаПоТекущемуМагазину() 
	
	//НастройкаВыгрузки = Справочники.ИС_Сбер_НастройкиВыгрузки.НайтиПоРеквизиту("Профиль", ЛичныйКабинет); 
	НастройкаВыгрузки = Справочники.ИС_Сбер_НастройкиВыгрузки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_Сбер_НастройкиВыгрузки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Сбер_НастройкиВыгрузки КАК ИС_Сбер_НастройкиВыгрузки
		|ГДЕ
		|	ИС_Сбер_НастройкиВыгрузки.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ";
	
	Запрос.УстановитьПараметр("Профиль", ЛичныйКабинет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НастройкаВыгрузки = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;
	
	Если ЛичныйКабинет.Пустая() Или НастройкаВыгрузки.Пустая() Тогда
		Для Каждого СтрокаТНП Из ТаблицаНастроекПолей Цикл
			СтруктураПозиционирования = Новый Структура("ПолеНастройки",СтрокаТНП.ПолеНастройки);
			СтрокиТСН = ТаблицаСоответствияНастроек.НайтиСтроки(СтруктураПозиционирования);
			Если СтрокиТСН.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаЗаполнения = СтрокиТСН[0];
			
			Если СтрокаЗаполнения.ПустоеПоле Тогда
				СтрокаТНП.ПредставлениеПустогоЗначения = СтрокаЗаполнения.Вариант;
				СтрокаТНП.ЗначениеПоля = "";
			Иначе
				СтрокаТНП.ЗначениеПоля = СтрокаЗаполнения.Вариант;
			КонецЕсли;
			
			СтрокаТНП.Настройка = СтрокаЗаполнения.Настройка;
			СтрокаТНП.СодержитЗначениеПоУмолчанию = СтрокаЗаполнения.СодержитЗначениеПоУмолчанию;
		КонецЦикла;
		СуществуютСохраненныеНастройки = Ложь;
	Иначе
		Для Каждого СтрокаСохраненныхНастроек Из НастройкаВыгрузки.НастройкиПолей Цикл
			СтруктураПозиционирования = Новый Структура("ПолеНастройки",СтрокаСохраненныхНастроек.Поле);
			
			СтрокиТСН = ТаблицаСоответствияНастроек.НайтиСтроки(СтруктураПозиционирования);
			СтрокиТНП = ТаблицаНастроекПолей.НайтиСтроки(СтруктураПозиционирования);
			
			Если СтрокиТСН.Количество() = 0 Тогда
				Продолжить;
			ИначеЕсли СтрокиТНП.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТСН = СтрокиТСН[0];
			СтрокаТНП = СтрокиТНП[0];
			
			Если СтрокаТСН.ПустоеПоле Тогда
				СтрокаТНП.ПредставлениеПустогоЗначения = СтрокаТСН.Вариант;
			КонецЕсли;
			
			СтрокаТНП.ЗначениеПоля	= СтрокаСохраненныхНастроек.ЗначениеПоля;
			СтрокаТНП.Настройка		= СтрокаСохраненныхНастроек.Настройка;
			СтрокаТНП.СодержитЗначениеПоУмолчанию = СтрокаТСН.СодержитЗначениеПоУмолчанию;
			
		КонецЦикла;
		СуществуютСохраненныеНастройки = Истина;
	КонецЕсли;
	
	Возврат СуществуютСохраненныеНастройки;
КонецФункции

&НаКлиенте
Процедура РандомноеСобытие(Параметр) Экспорт
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЛичныйКабинетПриИзменении()
	ПереопределитьЗапросСпискаТоваровФида();
	УстановитьПараметрыЛичногоКабинета();
	Если ЗаполнитьНастройкиФидаПоТекущемуМагазину() Тогда
		//Элементы.ГруппаСтраницыФункциональногоРазделения.ТекущаяСтраница = Элементы.СтраницаСписокТоваровФида;
		Элементы.ГруппаПодсказкаСохраненияНастроек.Видимость = Ложь;
		Элементы.СтраницаСписокТоваровФида.Доступность = Истина;
		Элементы.СтраницаСписокТоваровФида.ЦветФона = Новый Цвет();
	Иначе
		Элементы.ГруппаСтраницыФункциональногоРазделения.ТекущаяСтраница = Элементы.СтраницаНастройкиПолей;
		Элементы.ГруппаПодсказкаСохраненияНастроек.Видимость = Истина;
		Элементы.СтраницаСписокТоваровФида.Доступность = Ложь;
		Элементы.СтраницаСписокТоваровФида.ЦветФона = WebЦвета.СеребристоСерый;
		
		ТекстПредупреждения = "Для начала работы с разделом «Настройка фида» установите соответствие параметров. 
		|После сохранения настроек, раздел «Список товаров» с возможностью формирования фида станет доступен";
		ПоказатьПредупреждение(Новый ОписаниеОповещения("РандомноеСобытие",ЭтаФорма),ТекстПредупреждения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЛичныйКабинетПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПолейПриАктивизацииСтроки()
	Если Элементы.ТаблицаНастроекПолей.ТекущаяСтрока = Неопределено Тогда
		ОбычныеНастройки = Истина;
	ИначеЕсли Элементы.ТаблицаНастроекПолей.ТекущиеДанные = Неопределено Тогда
		ОбычныеНастройки = Истина;
	Иначе
		ОбычныеНастройки = Ложь;
	КонецЕсли;
	
	ПолеНастройкиЗначения = Элементы.ТаблицаНастроекПолейЗначениеПоля;
	ПолеНастройкиЗначения.СписокВыбора.Очистить();
	
	Если ОбычныеНастройки Тогда
		ПолеНастройкиЗначения.РежимВыбораИзСписка = Ложь;	
	Иначе
		ТекущиеДанныеСтроки = Элементы.ТаблицаНастроекПолей.ТекущиеДанные;
		
		ПолеНастройкиЗначения.ТолькоПросмотр = ТекущиеДанныеСтроки.Фиксация;
		
		СтруктураПозиционирования = Новый Структура("ПолеНастройки",ТекущиеДанныеСтроки.ПолеНастройки);
		СтрокиТСН = ТаблицаСоответствияНастроек.НайтиСтроки(СтруктураПозиционирования);
		
		Если СтрокиТСН.Количество() > 1 Тогда
			ПолеНастройкиЗначения.РежимВыбораИзСписка = Истина;
			Для Каждого СтрокаТСН Из СтрокиТСН Цикл
				ПолеНастройкиЗначения.СписокВыбора.Добавить(СтрокаТСН.Вариант);
			КонецЦикла;
			Если ПолеНастройкиЗначения.СписокВыбора.НайтиПоЗначению(ТекущиеДанныеСтроки.ЗначениеПоля) = Неопределено Тогда
				ПолеНастройкиЗначения.СписокВыбора.Добавить(ТекущиеДанныеСтроки.ЗначениеПоля);
			КонецЕсли;
		Иначе
			ПолеНастройкиЗначения.РежимВыбораИзСписка = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СуществуютЗаписиПоЛичномуКабинету(парЛичныйКабинет)
	ЗапросОбновления = Новый Запрос;
	ЗапросОбновления.УстановитьПараметр("ЛичныйКабинет",парЛичныйКабинет);
	ЗапросОбновления.Текст = "ВЫБРАТЬ Количество(*) КАК Записей Из РегистрСведений.ИС_Сбер_Фид ГДЕ Профиль = &ЛичныйКабинет";
	Выборка = ЗапросОбновления.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПризнакОбновления = Выборка.Записей > 0;
	Иначе
		ПризнакОбновления = Ложь;
	КонецЕсли;
	
	Возврат ПризнакОбновления;
КонецФункции

&НаСервере
Функция СохранитьНастройкиПолейНаСервере()
	//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735	
	Ссылка = Справочники.ИС_Сбер_НастройкиВыгрузки.НайтиПоРеквизиту("Профиль", ЛичныйКабинет);
	
	//+ ИнфоСофт Стояк Ю.К. 10.03.2025 УА #95753	
	//НовыеНастройки = Ссылка.ПолучитьОбъект();    
	//НовыеНастройки.НастройкиПолей.Очистить();
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		НовыеНастройки = Ссылка.ПолучитьОбъект();    
		НовыеНастройки.НастройкиПолей.Очистить();
	Иначе
		НовыеНастройки = Справочники.ИС_Сбер_НастройкиВыгрузки.СоздатьЭлемент()
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 10.03.2025 УА #95753
	//НовыеНастройки = Справочники.ИС_Сбер_НастройкиВыгрузки.СоздатьЭлемент();
	//- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
	Для Каждого СтрокаТНП Из ТаблицаНастроекПолей Цикл
		СтрокаНастройкиПолей = НовыеНастройки.НастройкиПолей.Добавить();
		СтрокаНастройкиПолей.Поле				 = СтрокаТНП.ПолеНастройки;
		СтрокаНастройкиПолей.ЗначениеПоля		 = СтрокаТНП.ЗначениеПоля;
		СтрокаНастройкиПолей.Настройка			 = СтрокаТНП.Настройка;
		СтрокаНастройкиПолей.ЗначениеПоУмолчанию = СтрокаТНП.СодержитЗначениеПоУмолчанию;
	КонецЦикла;
	НовыеНастройки.Профиль = ЛичныйКабинет;
	НовыеНастройки.Записать();
	
	Возврат СуществуютЗаписиПоЛичномуКабинету(ЛичныйКабинет);
КонецФункции

&НаКлиенте
Процедура ОбработкаДействияПользователяВВопросеПерезаполнения(ОтветПользователя,ДопПараметр) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьСписокФидаПоТекущимНастройкам();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиПолей(Команда)
	ТребуетсяОбновление = СохранитьНастройкиПолейНаСервере();
	ЛичныйКабинетПриИзменении();
	Если ТребуетсяОбновление Тогда
		ОбработкаОповещенияОтветаНаВопрос = Новый ОписаниеОповещения("ОбработкаДействияПользователяВВопросеПерезаполнения",ЭтаФорма);
		ПоказатьВопрос(ОбработкаОповещенияОтветаНаВопрос,"У вас существуют заполненные данные, обновить их по новым настройкам?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЭлементаИзСпискаДополнительныхРеквизитов(ЗначениеВыбора,парКонтекст) Экспорт
	Если ЗначениеВыбора = Неопределено Тогда
		СписокВыбора = Элементы.ТаблицаНастроекПолейЗначениеПоля.СписокВыбора;
		ИдЗн = СписокВыбора.Количество() - 1;
		Если СписокВыбора[ИдЗн].Значение = "Другое >>" ИЛИ СписокВыбора[ИдЗн].Значение = "Вид цен >>" Тогда
			РезультирующееЗначение = СписокВыбора[0].Значение;
		Иначе
			РезультирующееЗначение = СписокВыбора[ИдЗн].Значение;
		КонецЕсли;
	Иначе
		СтрокиКонтекста = ТаблицаНастроекПолей.НайтиСтроки(Новый Структура("ПолеНастройки",парКонтекст));
		Для Каждого СтрКонтекста Из СтрокиКонтекста Цикл
			СтрКонтекста.ЗначениеПоля = ЗначениеВыбора.Представление;
			СтрКонтекста.Настройка = ЗначениеВыбора.Значение;
		КонецЦикла;
		ТаблицаНастроекПолейПриАктивизацииСтроки();
		РезультирующееЗначение = ЗначениеВыбора.Представление;
	КонецЕсли;
	
	Элементы.ТаблицаНастроекПолей.ТекущиеДанные.ЗначениеПоля = РезультирующееЗначение;
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаВыбораЭлементаИзСпискаВидовЦен(ЗначениеВыбора,парКонтекст) Экспорт
	Если ЗначениеВыбора = Неопределено Тогда
		СписокВыбора = Элементы.ТаблицаНастроекПолейЗначениеПоля.СписокВыбора;
		ИдЗн = СписокВыбора.Количество() - 1;
		Если СписокВыбора[ИдЗн].Значение = "Другое >>" ИЛИ СписокВыбора[ИдЗн].Значение = "Вид цен >>" Тогда
			РезультирующееЗначение = СписокВыбора[0].Значение;
		Иначе
			РезультирующееЗначение = СписокВыбора[ИдЗн].Значение;
		КонецЕсли;
	Иначе
		СтрокиКонтекста = ТаблицаНастроекПолей.НайтиСтроки(Новый Структура("ПолеНастройки",парКонтекст));
		Для Каждого СтрКонтекста Из СтрокиКонтекста Цикл
			СтрКонтекста.ЗначениеПоля = ЗначениеВыбора.Представление;
			СтрКонтекста.Настройка = ЗначениеВыбора.Значение;
		КонецЦикла;
		ТаблицаНастроекПолейПриАктивизацииСтроки();
		РезультирующееЗначение = ЗначениеВыбора.Представление;
	КонецЕсли;
	
	Элементы.ТаблицаНастроекПолей.ТекущиеДанные.ЗначениеПоля = РезультирующееЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПолейЗначениеПоляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	парКонтекст = Элементы.ТаблицаНастроекПолей.ТекущиеДанные;
	Если ВыбранноеЗначение = "Другое >>" Тогда
		ОписаниеВыбора = Новый ОписаниеОповещения("ОбработкаВыбораЭлементаИзСпискаДополнительныхРеквизитов",ЭтаФорма,парКонтекст.ПолеНастройки);
		СписокДополнительныхРеквизитов.ПоказатьВыборЭлемента(ОписаниеВыбора,"Выберите соответствующее значение дополнительных свойств и реквизитов");
	ИначеЕсли ВыбранноеЗначение = "Вид цен >>" Тогда
		ОписаниеВыбора = Новый ОписаниеОповещения("ОбработкаВыбораЭлементаИзСпискаВидовЦен",ЭтаФорма,парКонтекст.ПолеНастройки);
		СписокТекстовогоПредставленияВидовЦен.ПоказатьВыборЭлемента(ОписаниеВыбора,"Выберите соответствующий вид цен номенклатуры");
	Иначе
		СтрокиТСН = ТаблицаСоответствияНастроек.НайтиСтроки(Новый Структура("ПолеНастройки,Вариант",парКонтекст.ПолеНастройки,ВыбранноеЗначение));
		СтрокиТНП = ТаблицаНастроекПолей.НайтиСтроки(Новый Структура("ПолеНастройки",парКонтекст.ПолеНастройки));
		Для Каждого СтрокаСоответствия Из СтрокиТСН Цикл
			СтрокаТНП = СтрокиТНП[0];
			СтрокаТНП.Настройка = СтрокаСоответствия.Настройка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#Область ЗаполнениеСпискаТоваровФида

&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735	
	//ФормаПодбора = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаВыбораГруппИЭлементов",,Элементы.СписокТоваровФида);
	//ФормаПодбора.Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
	//ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
	//ФормаПодбора.Открыть();  
		
	ПараметрыФормыПодбораТоваров = ПараметрыФормыПодбораТоваров();
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПодбора", ЭтотОбъект);
	ОткрытьФорму(ПараметрыФормыПодбораТоваров.ИмяФормы, ПараметрыФормыПодбораТоваров.ПараметрыФормы, ЭтотОбъект, , , ,
		Оповещение);
	//- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
КонецПроцедуры   
	
//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
&НаКлиенте
Процедура ПослеЗакрытияПодбора(Результат, СтруктураПараметров) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		Если Результат.Свойство("АдресТоваровВХранилище") Тогда
			ПослеЗакрытияПодбораНаСервере(Результат.АдресТоваровВХранилище);
		Иначе
			ПослеЗакрытияПодбораНаСервере(Результат.АдресКорзиныВХранилище);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735  

//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
&НаСервере
Процедура ПослеЗакрытияПодбораНаСервере(АдресТоваровВХранилище)

	ТаблицаПодбора = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	ТаблицаНоменклатуры = ТаблицаПодбора.Скопировать( , "Номенклатура, Упаковка, Характеристика");

	Для Каждого Элемент Из ТаблицаНоменклатуры Цикл
   		РегистрыСведений.ИС_Сбер_Фид.СформироватьЗаписиПоТовару(Элемент.Номенклатура, ЛичныйКабинет, Элемент.Характеристика, Элемент.Упаковка);
		Элементы.СписокТоваровФида.Обновить();
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735

//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
&НаСервере
Функция ПараметрыФормыПодбораТоваров() Экспорт    
	
	МассивПараметров = Новый Массив;		
	МассивПараметров.Добавить("ВидЦены");
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(ЛичныйКабинет, Перечисления.ИС_МП_Маркетплейсы.Сбер, МассивПараметров);
	
	ВидЦены = Результат.ВидЦены;  
	
	Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЦены, "ВалютаЦены");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Соглашение", Неопределено);
	ПараметрыФормы.Вставить("Организация", ЛичныйКабинет.Организация);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Ложь);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки", Ложь);	
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Подбор товаров';"));
	ПараметрыФормы.Вставить("Дата", ТекущаяДата());
	ПараметрыФормы.Вставить("Валюта", Валюта);
	ПараметрыФормы.Вставить("Документ", ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка"));
	ПараметрыФормы.Вставить("ПодборВариантовОбеспечения", Ложь);
	ПараметрыФормы.Вставить("ОстаткиПоВсемСкладам", Истина);	
	ПараметрыФормы.Вставить("РежимПодбораБезСоглашенийСКлиентами", Истина);
	ПараметрыФормы.Вставить("ВидЦены", ВидЦены);

	Результат = Новый Структура;
	Результат.Вставить("ИмяФормы", "Обработка.ПодборТоваровВДокументПродажи.Форма");
	Результат.Вставить("ПараметрыФормы", ПараметрыФормы);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735

&НаСервереБезКонтекста
Функция ПриведенноеЗначениеВыбораНоменклатуры(парВыбранноеЗначение)
	//MVM-88828
	ВозвращаемыйМассив = Новый Массив;
	Если парВыбранноеЗначение.ЭтоГруппа Тогда
		Запрос = Новый Запрос("Выбрать ссылка Из справочник.Номенклатура где ссылка в Иерархии(&парВыбранноеЗначение) И НЕ ЭтоГруппа И НЕ ПометкаУдаления");
		Запрос.УстановитьПараметр("парВыбранноеЗначение",парВыбранноеЗначение);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВозвращаемыйМассив.Добавить(Выборка.Ссылка);
		КонецЦикла;
	Иначе
		ВозвращаемыйМассив.Добавить(парВыбранноеЗначение);
	КонецЕсли;
	
	Возврат ВозвращаемыйМассив;
КонецФункции

&НаСервереБезКонтекста
Процедура СформироватьЗаписьСведенийФида(знач парНоменклатура, знач парЛичныйКабинет)
	СоответствиеПараметров = Истина;
	СоответствиеПараметров = Мин(СоответствиеПараметров,ТипЗнч(парНоменклатура) = Тип("СправочникСсылка.Номенклатура") И НЕ парНоменклатура.Пустая());
	СоответствиеПараметров = Мин(СоответствиеПараметров,ТипЗнч(парЛичныйКабинет) = Тип("СправочникСсылка.ИС_WB_Профили") И НЕ парЛичныйКабинет.Пустая());
	
	Если СоответствиеПараметров Тогда
		//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735		
		//РегистрыСведений.ИС_Сбер_Фид.СформироватьЗаписиПоТовару(парНоменклатура,парЛичныйКабинет);
		//- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровФидаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПриведенноеЗначениеВыбораПользователем = ПриведенноеЗначениеВыбораНоменклатуры(ВыбранноеЗначение);
	Для Каждого ЗначениеВыбора Из ПриведенноеЗначениеВыбораПользователем Цикл
		//СформироватьЗаписьТовараСММ(ЗначениеВыбора,ЛичныйКабинет);
		СформироватьЗаписьСведенийФида(ЗначениеВыбора,ЛичныйКабинет);
	КонецЦикла;
	Элементы.СписокТоваровФида.Обновить();
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Процедура ПерезаполнитьПоТекущимНастройкамНаСервере(парЛичныйКабинет)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛичныйКабинет",парЛичныйКабинет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Фид.Номенклатура КАК Номенклатура,
	//+ ИнфоСофт Заварин К.В. 16.10.24 УА #85764
	|	ИС_Сбер_Фид.Характеристика КАК Характеристика
	//- ИнфоСофт Заварин К.В. 16.10.24 УА #85764
	|ИЗ
	|	РегистрСведений.ИС_Сбер_Фид КАК ИС_Сбер_Фид
	|ГДЕ
	|	ИС_Сбер_Фид.Профиль = &ЛичныйКабинет";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//+ ИнфоСофт Заварин К.В. 16.10.24 УА #85764
		//РегистрыСведений.ИС_Сбер_Фид.СформироватьЗаписиПоТовару(Выборка.Номенклатура,парЛичныйКабинет);
		РегистрыСведений.ИС_Сбер_Фид.СформироватьЗаписиПоТовару(Выборка.Номенклатура, парЛичныйКабинет, Выборка.Характеристика);
		//- ИнфоСофт Заварин К.В. 16.10.24 УА #85764	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСписокФидаПоТекущимНастройкам()
	ПерезаполнитьПоТекущимНастройкамНаСервере(ЛичныйКабинет);
	Элементы.СписокТоваровФида.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоТекущимНастройкам()
	Если СуществуютЗаписиПоЛичномуКабинету(ЛичныйКабинет) Тогда
		ОбработкаОповещенияОтветаНаВопрос = Новый ОписаниеОповещения("ОбработкаДействияПользователяВВопросеПерезаполнения",ЭтаФорма);
		ПоказатьВопрос(ОбработкаОповещенияОтветаНаВопрос,"При перезаполнении ручные изменения будут утрачены, перезаполнить список?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьEXCELФид(Команда)
	СтруктураПараметра = Новый Структура("ЛичныйКабинет",ЛичныйКабинет);
	ФормаФормирования = ПолучитьФорму("Обработка.ИС_Сбер_ВыгрузкаКарточек.Форма.ФормаПредпросмотрXLSX",СтруктураПараметра);
	ФормаФормирования.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПолейЗначениеПоляПриИзменении(Элемент)
	Элементы.ГруппаПодсказкаСохраненияНастроек.Видимость = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТекстОписанияПроблемы(ДанныеСтроки)
	ТекстОписания = Новый ТекстовыйДокумент;
	Если ПустаяСтрока(ДанныеСтроки.offer_id) Тогда
		ТекстОписания.ДобавитьСтроку("Поле 'Offer ID' обязательное. Значение не может быть пустым");
	КонецЕсли;
	Если ПустаяСтрока(ДанныеСтроки.category) Тогда
		ТекстОписания.ДобавитьСтроку("Поле 'Категория' обязательное. Значение не может быть пустым");
	КонецЕсли;
	Если ПустаяСтрока(ДанныеСтроки.vendor) Тогда
		ТекстОписания.ДобавитьСтроку("Поле 'Производитель (Бренд)' обязательное. Значение не может быть пустым");
	КонецЕсли;
	Если ПустаяСтрока(ДанныеСтроки.vendor_code) Тогда
		ТекстОписания.ДобавитьСтроку("Поле 'Артикул' обязательное. Значение не может быть пустым");
	КонецЕсли;
	Если ПустаяСтрока(ДанныеСтроки.name) Тогда
		ТекстОписания.ДобавитьСтроку("Поле 'Название' обязательное. Значение не может быть пустым");
	КонецЕсли;
	Если ПустаяСтрока(ДанныеСтроки.model) Тогда
		ТекстОписания.ДобавитьСтроку("Поле 'Модель' обязательное. Значение не может быть пустым");
	КонецЕсли;
	//Если ПустаяСтрока(ДанныеСтроки.barcode) Тогда
	//	ТекстОписания.ДобавитьСтроку("Поле 'Штрих-код' обязательное. Значение не может быть пустым");
	//КонецЕсли;
	Если ?(ПустаяСтрока(ДанныеСтроки.price),0,Число(ДанныеСтроки.price)) <= 0 Тогда
		ТекстОписания.ДобавитьСтроку("Цена не может быть 0, отрицательной, пустым значением или содержать буквы");
	КонецЕсли;
	Если Число(ДанныеСтроки.instock) < 0 Тогда
		ТекстОписания.ДобавитьСтроку("Остаток не может быть отрицательным, пустым значением или содержать буквы");
	КонецЕсли;
	Если ДанныеСтроки.vat.Пустая() Тогда
		ТекстОписания.ДобавитьСтроку("Допустимые значения НДС — 0%, Без НДС, 10%, 10/110, 20%, 20/120");
	КонецЕсли;
	
	Возврат ТекстОписания.ПолучитьТекст();
КонецФункции

&НаКлиенте
Процедура ОповеститьОПроблемахЗаполненияСтроки()
	Если Элементы.СписокТоваровФида.ТекущаяСтрока = Неопределено Тогда
		ВидимостьОписанияПроблемы = Ложь;
	ИначеЕсли Элементы.СписокТоваровФида.ТекущиеДанные = Неопределено Тогда
		ВидимостьОписанияПроблемы = Ложь;
	ИначеЕсли НЕ Элементы.СписокТоваровФида.ТекущиеДанные.Проблема Тогда
		ВидимостьОписанияПроблемы = Ложь;
	Иначе
		СтруктураПереопределенияТД = Новый Структура("offer_id,category,vendor,vendor_code,name,price,instock,vat,model,barcode");
		Для Каждого ЭлементТД Из СтруктураПереопределенияТД Цикл
			ЗначениеПереопределения = Неопределено;
			Элементы.СписокТоваровФида.ТекущиеДанные.Свойство(ЭлементТД.Ключ,ЗначениеПереопределения);
			СтруктураПереопределенияТД.Вставить(ЭлементТД.Ключ,ЗначениеПереопределения);
		КонецЦикла;
		ТекстОписанияПроблемы = СформироватьТекстОписанияПроблемы(СтруктураПереопределенияТД);
		ВидимостьОписанияПроблемы = Истина;
	КонецЕсли;
	Элементы.ГруппаОписаниеПроблемыЗаполнения.Видимость = ВидимостьОписанияПроблемы;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровФидаПриАктивизацииСтроки(Элемент)
	ОповеститьОПроблемахЗаполненияСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровФидаПроблемаНажатие(Элемент, СтандартнаяОбработка)
	ОповеститьОПроблемахЗаполненияСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровФидаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.СписокТоваровФидаПроблема Тогда
		СтандартнаяОбработка = Ложь;
		ОповеститьОПроблемахЗаполненияСтроки();
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ЕстьЭлементКоллекции(ПарамКоллекция, ПарамЭлемент)
	ТипЗначенияКоллекции = ТипЗнч(ПарамКоллекция);
	Если ТипЗначенияКоллекции = Тип("Массив") Тогда
		ВозвращаемоеЗначение = ПарамКоллекция.Найти(ПарамЭлемент) <> Неопределено;
	ИначеЕсли ТипЗначенияКоллекции = Тип("СписокЗначений") Тогда
		ВозвращаемоеЗначение = ПарамКоллекция.НайтиПоЗначению(ПарамЭлемент) <> Неопределено;
	ИначеЕсли ТипЗначенияКоллекции = Тип("Структура") Тогда
		ВозвращаемоеЗначение = ПарамКоллекция.Свойство(ПарамЭлемент);
	ИначеЕсли ТипЗначенияКоллекции = Тип("Соответствие") Тогда
		ВозвращаемоеЗначение = ПарамКоллекция.Получить(ПарамЭлемент) <> Неопределено;
	Иначе
		ВозвращаемоеЗначение = Ложь;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
КонецФункции

&НаСервере
Функция СформироватьМассивПараметраДопСведенийИРеквизитов()
	МассивИмен = Новый Массив;
	МассивИмен.Добавить("Номенклатура");
	МассивИмен.Добавить("Виды номенклатуры");
	МассивИмен.Добавить("Характеристики номенклатуры");
	МассивИмен.Добавить("Справочник ""Номенклатура"" (Общие)");
	МассивИмен.Добавить("Справочник ""Номенклатура""");
	МассивИмен.Добавить("Справочник ""Виды номенклатуры""");
	МассивИмен.Добавить("Справочник ""Характеристики номенклатуры""");
	МассивИмен.Добавить("Справочник ""Характеристики номенклатуры"" (Общие)");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивИмен",МассивИмен);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений
		|ГДЕ
		|	Наименование В(&МассивИмен)";
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	ВозвращаемыйМассив = Новый Массив;
	Пока ВыборкаЗапроса.Следующий() Цикл
		ВозвращаемыйМассив.Добавить(ВыборкаЗапроса.Ссылка);
	КонецЦикла;
	
	Возврат ВозвращаемыйМассив;
КонецФункции

&НаСервере
Функция СформироватьСписокДополнительныхСвойствИАтрибутовНоменклатуры(парКонтекст = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизиты.Ссылка				КАК Набор,
		|	ДополнительныеРеквизиты.Ссылка.Наименование	КАК Наименование,
		|	ДополнительныеРеквизиты.Ссылка.Родитель		КАК Родитель,
		|	ДополнительныеРеквизиты.Свойство			КАК Свойство,
		|	ДополнительныеРеквизиты.Свойство.Наименование КАК ИмяСвойства,
		|	ДополнительныеРеквизиты.ИмяПредопределенногоНабора КАК ИмяПредопределенногоНабора,
		|	ДополнительныеРеквизиты.Свойство.ТипЗначения КАК СвойствоТипЗначения
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|ГДЕ
		|	ДополнительныеРеквизиты.Ссылка.Родитель В ИЕРАРХИИ(&ПараметрЗапроса)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Ссылка,
		|	ДополнительныеСведения.Ссылка.Наименование,
		|	ДополнительныеСведения.Ссылка.Родитель,
		|	ДополнительныеСведения.Свойство,
		|	ДополнительныеСведения.Свойство.Наименование,
		|	ДополнительныеСведения.ИмяПредопределенногоНабора,
		|	ДополнительныеСведения.Свойство.ТипЗначения
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ссылка.Родитель В ИЕРАРХИИ(&ПараметрЗапроса)";
	
	Если ТипЗнч(парКонтекст) = Тип("Массив") Тогда
		ПараметрЗапроса = парКонтекст;
	Иначе
		Если парКонтекст = Неопределено Тогда
			ПараметрЗапроса = СформироватьМассивПараметраДопСведенийИРеквизитов();
		ИначеЕсли ТипЗнч(парКонтекст) = Тип("СправочникСсылка.НаборыДополнительныхРеквизитовИСведений") Тогда
			ПараметрЗапроса = Новый Массив;
			ПараметрЗапроса.Добавить(парКонтекст);
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("ПараметрЗапроса", ПараметрЗапроса);
	
	ВозвращаемыйСписок = Новый СписокЗначений;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		РазмещениеСвойства = Новый Структура;
		РазмещениеСвойства.Вставить("Набор",	Строка(ЗначениеВСтрокуВнутр(Выборка.Набор)));
		РазмещениеСвойства.Вставить("Свойство",	Строка(ЗначениеВСтрокуВнутр(Выборка.Свойство)));
		ПредставлениеРазмещения = Записать(РазмещениеСвойства,ПереносСтрокJSON.Нет,ЭкранированиеСимволовJSON.СимволыВнеASCII);
		ВозвращаемыйСписок.Добавить(ПредставлениеРазмещения,Выборка.ИмяСвойства);
	КонецЦикла;
	
	Возврат ВозвращаемыйСписок;
КонецФункции

&НаСервере
Функция СформироватьСписокТекстовогоПредставленияВидовЦен()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыЦен.Ссылка			КАК Ссылка,
		|	ВидыЦен.Представление	КАК Представление
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Представление";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВозвращаемыйСписок = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ЗначениеСписка = Строка(ЗначениеВСтрокуВнутр(Выборка.Ссылка));
		ВозвращаемыйСписок.Добавить(ЗначениеСписка,Выборка.Представление);
	КонецЦикла;
	
	Возврат ВозвращаемыйСписок;
КонецФункции   

&НаСервере
Функция Записать(Структура,
				ПереносСтрок = Неопределено, 
				Экранирование = Неопределено) 
	
	Если ПереносСтрок = Неопределено Тогда	
		ПереносСтрок = ПереносСтрокJSON.Авто;
	КонецЕсли;
	Если Экранирование = Неопределено Тогда
		Экранирование = ЭкранированиеСимволовJSON.СимволыВнеASCII;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрок , Символы.Таб,,Экранирование);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	Попытка 
		ВозвращаемоеЗначение = ЗаписьJSON.Закрыть();
	Исключение
		ВозвращаемоеЗначение = Неопределено;
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
